apache/nuttx/arch/arm/src/stm32/stm32_comp_v1.c
static const struct comp_ops_s g_compops =
{
  .ao_shutdown  = comp_shutdown,
  .ao_setup     = comp_setup,
  .ao_read      = comp_read,
  .ao_ioctl     = comp_ioctl,
};

#ifdef CONFIG_STM32_COMP1
static struct stm32_comp_s g_comp1priv =
{
  .blanking  = COMP1_BLANKING,
  .pol  = COMP1_POL,
  .inm  = COMP1_INM,
  .out  = COMP1_OUTSEL,
  .lock = COMP1_LOCK,
  .csr  = STM32_COMP1_CSR,
#ifndef CONFIG_STM32_STM32F33XX
  .mode = COMP1_MODE,
  .hyst = COMP1_HYST,
#endif
};

static struct comp_dev_s g_comp1dev =
{
  .ad_ops  = &g_compops,
  .ad_priv = &g_comp1priv,
};
#endif

#ifdef CONFIG_STM32_COMP2
static struct stm32_comp_s g_comp2priv =
{
  .blanking  = COMP2_BLANKING,
  .pol  = COMP2_POL,
  .inm  = COMP2_INM,
  .out  = COMP2_OUTSEL,
  .lock = COMP2_LOCK,
  .csr  = STM32_COMP2_CSR,
#ifndef CONFIG_STM32_STM32F33XX
  .mode = COMP2_MODE,
  .hyst = COMP2_HYST,
#endif
};

static struct comp_dev_s g_comp2dev =
{
  .ad_ops  = &g_compops,
  .ad_priv = &g_comp2priv,
};
#endif

#ifdef CONFIG_STM32_COMP3
static struct stm32_comp_s g_comp3priv =
{
  .blanking  = COMP3_BLANKING,
  .pol  = COMP3_POL,
  .inm  = COMP3_INM,
  .out  = COMP3_OUTSEL,
  .lock = COMP3_LOCK,
  .csr  = STM32_COMP3_CSR,
#ifndef CONFIG_STM32_STM32F33XX
  .mode = COMP3_MODE,
  .hyst = COMP3_HYST,
#endif
};

static struct comp_dev_s g_comp3dev =
{
  .ad_ops  = &g_compops,
  .ad_priv = &g_comp3priv,
};
#endif

#ifdef CONFIG_STM32_COMP4
static struct stm32_comp_s g_comp4priv =
{
  .blanking  = COMP4_BLANKING,
  .pol  = COMP4_POL,
  .inm  = COMP4_INM,
  .out  = COMP4_OUTSEL,
  .lock = COMP4_LOCK,
  .csr  = STM32_COMP4_CSR,
#ifndef CONFIG_STM32_STM32F33XX
  .mode = COMP4_MODE,
  .hyst = COMP4_HYST,
#endif
};

static struct comp_dev_s g_comp4dev =
{
  .ad_ops  = &g_compops,
  .ad_priv = &g_comp4priv,
};
#endif

#ifdef CONFIG_STM32_COMP5
static struct stm32_comp_s g_comp5priv =
{
  .blanking  = COMP5_BLANKING,
  .pol  = COMP5_POL,
  .inm  = COMP5_INM,
  .out  = COMP5_OUTSEL,
  .lock = COMP5_LOCK,
  .csr  = STM32_COMP5_CSR,
#ifndef CONFIG_STM32_STM32F33XX
  .mode = COMP5_MODE,
  .hyst = COMP5_HYST,
#endif
};

static struct comp_dev_s g_comp5dev =
{
  .ad_ops  = &g_compops,
  .ad_priv = &g_comp5priv,
};
#endif

#ifdef CONFIG_STM32_COMP6
static struct stm32_comp_s g_comp6priv =
{
  .blanking  = COMP6_BLANKING,
  .pol  = COMP6_POL,
  .inm  = COMP6_INM,
  .out  = COMP6_OUTSEL,
  .lock = COMP6_LOCK,
  .csr  = STM32_COMP6_CSR,
#ifndef CONFIG_STM32_STM32F33XX
  .mode = COMP6_MODE,
  .hyst = COMP6_HYST,
#endif
};

static struct comp_dev_s g_comp6dev =
{
  .ad_ops  = &g_compops,
  .ad_priv = &g_comp6priv,
};
#endif

#ifdef CONFIG_STM32_COMP7
static struct stm32_comp_s g_comp7priv =
{
  .blanking  = COMP7_BLANKING,
  .pol  = COMP7_POL,
  .inm  = COMP7_INM,
  .out  = COMP7_OUTSEL,
  .lock = COMP7_LOCK,
  .csr  = STM32_COMP7_CSR,
#ifndef CONFIG_STM32_STM32F33XX
  .mode = COMP7_MODE,
  .hyst = COMP7_HYST,
#endif
};

static struct comp_dev_s g_comp7dev =
{
  .ad_ops  = &g_compops,
  .ad_priv = &g_comp7priv,
};
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: comp_modify_csr
 *
 * Description:
 *   Modify the value of a 32-bit COMP CSR register (not atomic).
 *
 * Input Parameters:
 *   priv   - A reference to the COMP structure
 *   clrbits - The bits to clear
 *   setbits - The bits to set
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static inline void comp_modify_csr(struct stm32_comp_s *priv,
                                   uint32_t clearbits, uint32_t setbits)
{
  uint32_t csr = priv->csr;

  modifyreg32(csr, clearbits, setbits);
}

/****************************************************************************
 * Name: comp_getreg_csr
 *
 * Description:
 *   Read the value of an COMP CSR register
 *
 * Input Parameters:
 *   priv   - A reference to the COMP structure
 *
 * Returned Value:
 *   The current contents of the COMP CSR register
 *
 ****************************************************************************/

static inline uint32_t comp_getreg_csr(struct stm32_comp_s *priv)
{
  uint32_t csr = priv->csr;

  return getreg32(csr);
}

/****************************************************************************
 * Name: comp_putreg_csr
 *
 * Description:
 *   Write a value to an COMP register.
 *
 * Input Parameters:
 *   priv   - A reference to the COMP structure
 *   value  - The value to write to the COMP CSR register
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static inline void comp_putreg_csr(struct stm32_comp_s *priv,
                                   uint32_t value)
{
  uint32_t csr = priv->csr;

  putreg32(value, csr);
}

/****************************************************************************
 * Name: stm32_comp_complock_get
 *
 * Description:
 *   Get COMP lock bit state
 *
 * Input Parameters:
 *   priv   - A reference to the COMP structure
 *
 * Returned Value:
 *   True if COMP locked, false if not locked
 *
 ****************************************************************************/

static bool stm32_complock_get(struct stm32_comp_s *priv)
{
  uint32_t regval;

  regval = comp_getreg_csr(priv);

  return (((regval & COMP_CSR_LOCK) == 0) ? false : true);
}

/****************************************************************************
 * Name: stm32_complock
 *
 * Description:
 *   Lock comparator CSR register
 *
 * Input Parameters:
 *   priv   - A reference to the COMP structure
 *   enable - lock flag
 *
 * Returned Value:
 *  0 on success, a negated errno value on failure
 *
 ****************************************************************************/

static int stm32_complock(struct stm32_comp_s *priv, bool lock)
{
  bool current;

  current = stm32_complock_get(priv);

  if (current)
    {
      if (lock == false)
        {
          aerr("ERROR: COMP LOCK can be cleared only by a system reset\n");

