apache/nuttx/arch/arm/src/stm32/stm32_comp_v1.c
          return -EPERM;
        }
    }
  else
    {
      if (lock == true)
        {
          comp_modify_csr(priv, 0, COMP_CSR_LOCK);

          priv->lock = COMP_LOCK_RO;
        }
    }

  return OK;
}

/****************************************************************************
 * Name: stm32_compconfig
 *
 * Description:
 *   Configure comparator and used I/Os
 *
 * Input Parameters:
 *   priv   - A reference to the COMP structure
 *
 * Returned Value:
 *  0 on success, a negated errno value on failure
 *
 * REVISIT: Where to config comparator output pin ?
 *
 ****************************************************************************/

static int stm32_compconfig(struct stm32_comp_s *priv)
{
  uint32_t regval = 0;
  int index;

  /* Get comparator index */

  switch (priv->csr)
    {
#ifdef CONFIG_STM32_COMP1
    case STM32_COMP1_CSR:
      index = 1;
      break;
#endif

#ifdef CONFIG_STM32_COMP2
    case STM32_COMP2_CSR:
      index = 2;
      break;
#endif

#ifdef CONFIG_STM32_COMP3
    case STM32_COMP3_CSR:
      index = 3;
      break;
#endif

#ifdef CONFIG_STM32_COMP4
    case STM32_COMP4_CSR:
      index = 4;
      break;
#endif

#ifdef CONFIG_STM32_COMP5
    case STM32_COMP5_CSR:
      index = 5;
      break;
#endif

#ifdef CONFIG_STM32_COMP6
    case STM32_COMP6_CSR:
      index = 6;
      break;
#endif

#ifdef CONFIG_STM32_COMP7
    case STM32_COMP7_CSR:
      index = 7;
      break;
#endif

    default:
      return -EINVAL;
    }

  /* Configure non inverting input */

  switch (index)
    {
#ifdef CONFIG_STM32_COMP1
    case 1:
      stm32_configgpio(GPIO_COMP1_INP);
      break;
#endif

#ifdef CONFIG_STM32_COMP2
    case 2:
      stm32_configgpio(GPIO_COMP2_INP);
      break;
#endif

#ifdef CONFIG_STM32_COMP3
    case 3:
      stm32_configgpio(GPIO_COMP3_INP);
      break;
#endif

#ifdef CONFIG_STM32_COMP4
    case 4:
      stm32_configgpio(GPIO_COMP4_INP);
      break;
#endif

#ifdef CONFIG_STM32_COMP5
    case 5:
      stm32_configgpio(GPIO_COMP5_INP);
      break;
#endif

#ifdef CONFIG_STM32_COMP6
    case 6:
      stm32_configgpio(GPIO_COMP6_INP);
      break;
#endif

#ifdef CONFIG_STM32_COMP7
    case 7:
      stm32_configgpio(GPIO_COMP7_INP);
      break;
#endif

    default:
      return -EINVAL;
    }

  /* Set Comparator inverting input */

  switch (priv->inm)
    {
    case COMP_INMSEL_1P4VREF:
      regval |= COMP_CSR_INMSEL_1P4VREF;
      break;

    case COMP_INMSEL_1P2VREF:
      regval |= COMP_CSR_INMSEL_1P2VREF;
      break;

    case COMP_INMSEL_3P4VREF:
      regval |= COMP_CSR_INMSEL_3P4VREF;
      break;

    case COMP_INMSEL_VREF:
      regval |= COMP_CSR_INMSEL_VREF;
      break;

    case COMP_INMSEL_DAC1CH1:
      regval |= COMP_CSR_INMSEL_DAC1CH1;
      break;

    case COMP_INMSEL_DAC1CH2:
      regval |= COMP_CSR_INMSEL_DAC1CH2;
      break;

    case COMP_INMSEL_PIN:
      {
        /* INMSEL PIN configuration dependent on COMP index */

        switch (index)
          {
            /* TODO: Inverting input pin configuration for COMP1/3/5/7 */

#ifdef CONFIG_STM32_COMP2
          case 2:
            {
              /* COMP2_INM can be PA2 or PA4 */

              stm32_configgpio(GPIO_COMP2_INM);
              regval |= (GPIO_COMP2_INM == GPIO_COMP2_INM_1 ?
                         COMP_CSR_INMSEL_PA2 : COMP_CSR_INMSEL_PA4);
              break;
            }
#endif

#ifdef CONFIG_STM32_COMP4
          case 4:
            {
              /* COMP4_INM can be PB2 or PA4 */

              stm32_configgpio(GPIO_COMP4_INM);
              regval |= (GPIO_COMP4_INM == GPIO_COMP4_INM_1 ?
                         COMP_CSR_INMSEL_PB2 : COMP_CSR_INMSEL_PA4);
              break;
            }
#endif

#ifdef CONFIG_STM32_COMP6
          case 6:
            {
              /* COMP6_INM can be PB15 or PA4 */

              stm32_configgpio(GPIO_COMP6_INM);
              regval |= (GPIO_COMP6_INM == GPIO_COMP6_INM_1 ?
                         COMP_CSR_INMSEL_PB15 : COMP_CSR_INMSEL_PA4);
              break;
            }
#endif

          default :
            return -EINVAL;
          }

        break;
      }

    default:
      return -EINVAL;
    }

  /* Set Comparator output selection */

  switch (priv->out)
    {
    case COMP_OUTSEL_NOSEL:
      regval |= COMP_CSR_OUTSEL_NOSEL;
      break;

    case COMP_OUTSEL_BRKACTH:
      regval |= COMP_CSR_OUTSEL_BRKACTH;
      break;

    case COMP_OUTSEL_BRK2:
      regval |= COMP_CSR_OUTSEL_BRK2;
      break;

    case COMP_OUTSEL_T1OCC:
      regval |= COMP_CSR_OUTSEL_T1OCC;
      break;

    case COMP_OUTSEL_T3CAP3:
      regval |= COMP_CSR_OUTSEL_T3CAP3;
      break;

    case COMP_OUTSEL_T2CAP2:
      regval |= COMP_CSR_OUTSEL_T2CAP2;
      break;

    case COMP_OUTSEL_T1CAP1:
      regval |= COMP_CSR_OUTSEL_T1CAP1;
      break;

    case COMP_OUTSEL_T2CAP4:
      regval |= COMP_CSR_OUTSEL_T2CAP4;
      break;

    case COMP_OUTSEL_T15CAP2:
      regval |= COMP_CSR_OUTSEL_T15CAP2;
      break;

    case COMP_OUTSEL_T2OCC:
      if (index == 2)
        {
          regval |= COMP2_CSR_OUTSEL_T2OCC;
        }
      else if (index == 6)
        {
          regval |= COMP6_CSR_OUTSEL_T2OCC;
        }

      break;

    case COMP_OUTSEL_T16OCC:
      regval |= COMP_CSR_OUTSEL_T16OCC;
      break;

    case COMP_OUTSEL_T3CAP1:
      regval |= COMP_CSR_OUTSEL_T3CAP1;
      break;

    case COMP_OUTSEL_T15OCC:
      regval |= COMP_CSR_OUTSEL_T15OCC;
      break;

    case COMP_OUTSEL_T16CAP1:
      regval |= COMP_CSR_OUTSEL_T16CAP1;
      break;

    case COMP_OUTSEL_T3OCC:
      regval |= COMP_CSR_OUTSEL_T3OCC;
      break;

    default:
      return -EINVAL;
    }

  /* Set Comparator output polarity */

  regval |= (priv->pol == COMP_POL_INVERTED ? COMP_CSR_POL : 0);

  /* Set Comparator output blanking source */

  switch (priv->blanking)
    {
    case COMP_BLANKING_DIS:
      regval |= COMP_CSR_BLANKING_DIS;
      break;

    case COMP_BLANKING_T1OC5:
      regval |= COMP_CSR_BLANKING_T1OC5;
      break;

